[{"text": "CCSS.ELA-Literacy.WHST.11-12.1 Write arguments focused on discipline-specific content .", "children": 5, "standard_slug": "1", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.2 Write informative/explanatory texts, including the narration of historical events, scientific procedures/experiments, or technical processes.", "children": 5, "standard_slug": "2", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.3 (See note; not applicable as a separate requirement)", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.4 Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.5 Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.6 Use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.7 Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.8 Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the specific task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation.", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.9 Draw evidence from informational texts to support analysis, reflection, and research.", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.10 Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:20.068568"}]