[{"text": "CCSS.ELA-Literacy.RI.8.1 Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.2 Determine a central idea of a text and analyze its development over the course of the text, including its relationship to supporting ideas; provide an objective summary of the text.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.3 Analyze how a text makes connections among and distinctions between individuals, ideas, or events (e.g., through comparisons, analogies, or categories).", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.4 Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts.", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.5 Analyze in detail the structure of a specific paragraph in a text, including the role of particular sentences in developing and refining a key concept.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.6 Determine an author's point of view or purpose in a text and analyze how the author acknowledges and responds to conflicting evidence or viewpoints.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.7 Evaluate the advantages and disadvantages of using different mediums (e.g., print or digital text, video, multimedia) to present a particular topic or idea.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.8 Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient; recognize when irrelevant evidence is introduced.", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.9 Analyze a case in which two or more texts provide conflicting information on the same topic and identify where the texts disagree on matters of fact or interpretation.", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:09.937653"}, {"text": "CCSS.ELA-Literacy.RI.8.10 By the end of the year, read and comprehend literary nonfiction at the high end of the grades 6-8 text complexity band independently and proficiently.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:09.937653"}]