{"text": "Functions", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.8.F.A.1 Understand that a function is a rule that assigns to each input exactly one output. The graph of a function is the set of ordered pairs consisting of an input and the corresponding output.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:52.841844"}, {"text": "CCSS.Math.Content.8.F.A.2 Compare properties of two functions each represented in a different way (algebraically, graphically, numerically in tables, or by verbal descriptions). For example, given a linear function represented by a table of values and a linear function represented by an algebraic expression, determine which function has the greater rate of change .", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:52.841844"}, {"text": "CCSS.Math.Content.8.F.A.3 Interpret the equation y = mx + b as defining a linear function, whose graph is a straight line; give examples of functions that are not linear. For example, the function A = s .", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:52.841844"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:52.841844"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.8.F.B.4 Construct a function to model a linear relationship between two quantities. Determine the rate of change  and initial value of the function from a description of a relationship or from two ( x, y ) values, including reading these from a table or from a graph. Interpret the rate of change and initial value of a linear function in terms of the situation it models, and in terms of its graph or a table of values.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:52.841844"}, {"text": "CCSS.Math.Content.8.F.B.5 Describe qualitatively the functional relationship between two quantities by analyzing a graph (e.g., where the function is increasing or decreasing, linear or nonlinear). Sketch a graph that exhibits the qualitative features of a function that has been described verbally.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:52.841844"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:52.841844"}], "standard_slug": "F"}