{"text": "Number & Operations in Base Ten", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.4.NBT.A.1 Recognize that in a multi-digit whole number, a digit in one place represents ten times what it represents in the place to its right. For example, recognize that 700 ÷ 70 = 10 by applying concepts of place value and division .", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:45.976143"}, {"text": "CCSS.Math.Content.4.NBT.A.2 Read and write multi-digit whole numbers using base-ten numerals, number names, and expanded form. Compare two multi-digit numbers based on meanings of the digits in each place, using >, =, and < symbols to record the results of comparisons.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:45.976143"}, {"text": "CCSS.Math.Content.4.NBT.A.3 Use place value understanding to round multi-digit whole numbers to any place.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:45.976143"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:45.976143"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.4.NBT.B.4 Fluently add and subtract multi-digit whole numbers using the standard algorithm.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:45.976143"}, {"text": "CCSS.Math.Content.4.NBT.B.5 Multiply a whole number of up to four digits by a one-digit whole number, and multiply two two-digit numbers, using strategies based on place value and the properties of operations. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:45.976143"}, {"text": "CCSS.Math.Content.4.NBT.B.6 Find whole-number quotients and remainders with up to four-digit dividends and one-digit divisors, using strategies based on place value, the properties of operations, and/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:45.976143"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:45.976143"}], "standard_slug": "NBT"}