{"text": "Grade 9-10", "children": [{"text": "CCSS.ELA-Literacy.W.9-10.1 Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.", "children": [{"text": "CCSS.ELA-Literacy.W.9-10.1.a Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among claim(s), counterclaims, reasons, and evidence.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.1.b Develop claim(s) and counterclaims fairly, supplying evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience's knowledge level and concerns.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.1.c Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.1.d Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.1.e Provide a concluding statement or section that follows from and supports the argument presented.", "children": [], "standard_slug": "e", "retrieved": "2016-12-31 23:39:13.516321"}], "standard_slug": "1", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.2 Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content.", "children": [{"text": "CCSS.ELA-Literacy.W.9-10.2.a Introduce a topic; organize complex ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.2.b Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.2.c Use appropriate and varied transitions to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.2.d Use precise language and domain-specific vocabulary to manage the complexity of the topic.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.2.e Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.", "children": [], "standard_slug": "e", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.2.f Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic).", "children": [], "standard_slug": "f", "retrieved": "2016-12-31 23:39:13.516321"}], "standard_slug": "2", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.3 Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.", "children": [{"text": "CCSS.ELA-Literacy.W.9-10.3.a Engage and orient the reader by setting out a problem, situation, or observation, establishing one or multiple point(s) of view, and introducing a narrator and/or characters; create a smooth progression of experiences or events.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.3.b Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and/or characters.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.3.c Use a variety of techniques to sequence events so that they build on one another to create a coherent whole.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.3.d Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and/or characters.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.3.e Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative.", "children": [], "standard_slug": "e", "retrieved": "2016-12-31 23:39:13.516321"}], "standard_slug": "3", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.4 Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.5 Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grades 9-10 here .)", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.6 Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology's capacity to link to other information and to display information flexibly and dynamically.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.7 Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.8 Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.9 Draw evidence from literary or informational texts to support analysis, reflection, and research.", "children": [{"text": "CCSS.ELA-Literacy.W.9-10.9.a Apply grades 9-10 Reading standards to literature (e.g., \"Analyze how an author draws on and transforms source material in a specific work [e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare]\").", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.9.b Apply grades 9-10 Reading standards to literary nonfiction (e.g., \"Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is valid and the evidence is relevant and sufficient; identify false statements and fallacious reasoning\").", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:13.516321"}], "standard_slug": "9", "retrieved": "2016-12-31 23:39:13.516321"}, {"text": "CCSS.ELA-Literacy.W.9-10.10 Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences.", "children": [], "standard_slug": "10", "retrieved": "2016-12-31 23:39:13.516321"}], "standard_slug": "9-10"}