{"text": "Grade 6", "children": [{"text": "CCSS.ELA-Literacy.SL.6.1 Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 6 topics, texts, and issues, building on others' ideas and expressing their own clearly.", "children": [{"text": "CCSS.ELA-Literacy.SL.6.1.a Come to discussions prepared, having read or studied required material; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.1.b Follow rules for collegial discussions, set specific goals and deadlines, and define individual roles as needed.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.1.c Pose and respond to specific questions with elaboration and detail by making comments that contribute to the topic, text, or issue under discussion.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.1.d Review the key ideas expressed and demonstrate understanding of multiple perspectives through reflection and paraphrasing.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:15.257452"}], "standard_slug": "1", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.2 Interpret information presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how it contributes to a topic, text, or issue under study.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.3 Delineate a speaker's argument and specific claims, distinguishing claims that are supported by reasons and evidence from claims that are not.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.4 Present claims and findings, sequencing ideas logically and using pertinent descriptions, facts, and details to accentuate main ideas or themes; use appropriate eye contact, adequate volume, and clear pronunciation.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.5 Include multimedia components (e.g., graphics, images, music, sound) and visual displays in presentations to clarify information.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:15.257452"}, {"text": "CCSS.ELA-Literacy.SL.6.6 Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grade 6 Language standards 1 and 3 for specific expectations.)", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:15.257452"}], "standard_slug": "6"}