[{"text": "CCSS.ELA-Literacy.RL.6.1 Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:02.428914"}, {"text": "CCSS.ELA-Literacy.RL.6.2 Determine a theme or central idea of a text and how it is conveyed through particular details; provide a summary of the text distinct from personal opinions or judgments.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:02.428914"}, {"text": "CCSS.ELA-Literacy.RL.6.3 Describe how a particular story's or drama's plot unfolds in a series of episodes as well as how the characters respond or change as the plot moves toward a resolution.", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.4 Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of a specific word choice on meaning and tone", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.5 Analyze how a particular sentence, chapter, scene, or stanza fits into the overall structure of a text and contributes to the development of the theme, setting, or plot.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.6 Explain how an author develops the point of view of the narrator or speaker in a text.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.7 Compare and contrast the experience of reading a story, drama, or poem to listening to or viewing an audio, video, or live version of the text, including contrasting what they \"see\" and \"hear\" when reading the text to what they perceive when they listen or watch.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.8 (RL.6.8 not applicable to literature)", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.9 Compare and contrast texts in different forms or genres (e.g., stories and poems; historical novels and fantasy stories) in terms of their approaches to similar themes and topics.", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:02.429919"}, {"text": "CCSS.ELA-Literacy.RL.6.10 By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:02.429919"}]