{"children": [{"retrieved": "2016-12-31 23:38:52.147395", "children": [{"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.7.SP.A.1 Understand that statistics can be used to gain information about a population by examining a sample of the population; generalizations about a population from a sample are valid only if the sample is representative of that population. Understand that random sampling tends to produce representative samples and support valid inferences."}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.7.SP.A.2 Use data from a random sample to draw inferences about a population with an unknown characteristic of interest. Generate multiple samples (or simulated samples) of the same size to gauge the variation in estimates or predictions. For example, estimate the mean word length in a book by randomly sampling words from the book; predict the winner of a school election based on randomly sampled survey data. Gauge how far off the estimate or prediction might be ."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [{"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.7.SP.B.3 Informally assess the degree of visual overlap of two numerical data distributions with similar variabilities, measuring the difference between the centers by expressing it as a multiple of a measure of variability. For example, the mean height of players on the basketball team is 10 cm greater than the mean height of players on the soccer team, about twice the variability (mean absolute deviation) on either team; on a dot plot, the separation between the two distributions of heights is noticeable ."}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.7.SP.B.4 Use measures of center and measures of variability for numerical data from random samples to draw informal comparative inferences about two populations. For example, decide whether the words in a chapter of a seventh-grade science book are generally longer than the words in a chapter of a fourth-grade science book ."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [{"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.7.SP.C.5 Understand that the probability of a chance event is a number between 0 and 1 that expresses the likelihood of the event occurring. Larger numbers indicate greater likelihood. A probability near 0 indicates an unlikely event, a probability around 1/2 indicates an event that is neither unlikely nor likely, and a probability near 1 indicates a likely event."}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.7.SP.C.6 Approximate the probability of a chance event by collecting data on the chance process that produces it and observing its long-run relative frequency, and predict the approximate relative frequency given the probability. For example, when rolling a number cube 600 times, predict that a 3 or 6 would be rolled roughly 200 times, but probably not exactly 200 times ."}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.7.SP.C.7 Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy."}, {"retrieved": "2016-12-31 23:38:52.147395", "children": [], "standard_slug": "8", "text": "CCSS.Math.Content.7.SP.C.8 Find probabilities of compound events using organized lists, tables, tree diagrams, and simulation."}], "standard_slug": "C", "text": "C"}], "standard_slug": "SP", "text": "Statistics & Probability"}