{"text": "Statistics & Probability", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.8.SP.A.1 Construct and interpret scatter plots for bivariate measurement data to investigate patterns of association between two quantities. Describe patterns such as clustering, outliers, positive or negative association, linear association, and nonlinear association.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:53.900034"}, {"text": "CCSS.Math.Content.8.SP.A.2 Know that straight lines are widely used to model relationships between two quantitative variables. For scatter plots that suggest a linear association, informally fit a straight line, and informally assess the model fit by judging the closeness of the data points to the line.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:53.900034"}, {"text": "CCSS.Math.Content.8.SP.A.3 Use the equation of a linear model to solve problems in the context of bivariate measurement data, interpreting the slope and intercept. For example, in a linear model for a biology experiment, interpret a slope of 1.5 cm/hr as meaning that an additional hour of sunlight each day is associated with an additional 1.5 cm in mature plant height .", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:53.900034"}, {"text": "CCSS.Math.Content.8.SP.A.4 Understand that patterns of association can also be seen in bivariate categorical data by displaying frequencies and relative frequencies in a two-way table. Construct and interpret a two-way table summarizing data on two categorical variables collected from the same subjects. Use relative frequencies calculated for rows or columns to describe possible association between the two variables. For example, collect data from students in your class on whether or not they have a curfew on school nights and whether or not they have assigned chores at home. Is there evidence that those who have a curfew also tend to have chores?", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:53.900034"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:53.900034"}], "standard_slug": "SP"}