{"children": [{"children": [{"retrieved": "2016-12-31 23:38:49.834406", "children": [{"retrieved": "2016-12-31 23:38:49.834406", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.6.RP.A.1 Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities. For example, \"The ratio of wings to beaks in the bird house at the zoo was 2:1, because for every 2 wings there was 1 beak.\" \"For every vote candidate A received, candidate C received nearly three votes.\""}, {"retrieved": "2016-12-31 23:38:49.834406", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.6.RP.A.2 Understand the concept of a unit rate a/b associated with a ratio a:b with b ≠ 0, and use rate language in the context of a ratio relationship. For example, \"This recipe has a ratio of 3 cups of flour to 4 cups of sugar, so there is 3/4 cup of flour for each cup of sugar.\" \"We paid $75 for 15 hamburgers, which is a rate of $5 per hamburger.\""}, {"retrieved": "2016-12-31 23:38:49.834406", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.6.RP.A.3 Use ratio and rate reasoning to solve real-world and mathematical problems, e.g., by reasoning about tables of equivalent ratios, tape diagrams, double number line diagrams, or equations."}], "standard_slug": "A", "text": "A"}], "standard_slug": "RP", "text": "Ratios & Proportional Relationships"}, {"children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.6.NS.A.1 Interpret and compute quotients of fractions, and solve word problems involving division of fractions by fractions, e.g., by using visual fraction models and equations to represent the problem. For example, create a story context for (2/3) ÷ (3/4) and use a visual fraction model to show the quotient; use the relationship between multiplication and division to explain that (2/3) ÷ (3/4) = 8/9 because 3/4 of 8/9 is 2/3. (In general, (a/b) ÷ (c/d) = ad/bc.) How much chocolate will each person get if 3 people share 1/2 lb of chocolate equally? How many 3/4-cup servings are in 2/3 of a cup of yogurt? How wide is a rectangular strip of land with length 3/4 mi and area 1/2 square mi? ."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.6.NS.B.2 Fluently divide multi-digit numbers using the standard algorithm."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.6.NS.B.3 Fluently add, subtract, multiply, and divide multi-digit decimals using the standard algorithm for each operation."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.6.NS.B.4 Find the greatest common factor of two whole numbers less than or equal to 100 and the least common multiple of two whole numbers less than or equal to 12. Use the distributive property to express a sum of two whole numbers 1-100 with a common factor as a multiple of a sum of two whole numbers with no common factor. For example, express 36 + 8 as 4 (9 + 2). ."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.6.NS.C.5 Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above/below zero, elevation above/below sea level, credits/debits, positive/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.6.NS.C.6 Understand a rational number as a point on the number line. Extend number line diagrams and coordinate axes familiar from previous grades to represent points on the line and in the plane with negative number coordinates."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.6.NS.C.7 Understand ordering and absolute value of rational numbers."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "8", "text": "CCSS.Math.Content.6.NS.C.8 Solve real-world and mathematical problems by graphing points in all four quadrants of the coordinate plane. Include use of coordinates and absolute value to find distances between points with the same first coordinate or the same second coordinate."}], "standard_slug": "C", "text": "C"}], "standard_slug": "NS", "text": "The Number System"}, {"children": [{"retrieved": "2016-12-31 23:38:50.685853", "children": [{"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.6.EE.A.1 Write and evaluate numerical expressions involving whole-number exponents."}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.6.EE.A.2 Write, read, and evaluate expressions in which letters stand for numbers."}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.6.EE.A.3 Apply the properties of operations to generate equivalent expressions. For example, apply the distributive property to the expression 3 (2 + x) to produce the equivalent expression 6 + 3x; apply the distributive property to the expression 24x + 18y to produce the equivalent expression 6 (4x + 3y); apply properties of operations to y + y + y to produce the equivalent expression 3y ."}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.6.EE.A.4 Identify when two expressions are equivalent (i.e., when the two expressions name the same number regardless of which value is substituted into them). For example, the expressions y + y + y and 3y are equivalent because they name the same number regardless of which number y stands for. ."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [{"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.6.EE.B.5 Understand solving an equation or inequality as a process of answering a question: which values from a specified set, if any, make the equation or inequality true? Use substitution to determine whether a given number in a specified set makes an equation or inequality true."}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.6.EE.B.6 Use variables to represent numbers and write expressions when solving a real-world or mathematical problem; understand that a variable can represent an unknown number, or, depending on the purpose at hand, any number in a specified set."}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.6.EE.B.7 Solve real-world and mathematical problems by writing and solving equations of the form x + p = q and px = q for cases in which p , q and x are all nonnegative rational numbers."}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "8", "text": "CCSS.Math.Content.6.EE.B.8 Write an inequality of the form x > c or x < c to represent a constraint or condition in a real-world or mathematical problem. Recognize that inequalities of the form x > c or x < c have infinitely many solutions; represent solutions of such inequalities on number line diagrams."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:50.685853", "children": [{"retrieved": "2016-12-31 23:38:50.685853", "children": [], "standard_slug": "9", "text": "CCSS.Math.Content.6.EE.C.9 Use variables to represent two quantities in a real-world problem that change in relationship to one another; write an equation to express one quantity, thought of as the dependent variable, in terms of the other quantity, thought of as the independent variable. Analyze the relationship between the dependent and independent variables using graphs and tables, and relate these to the equation. For example, in a problem involving motion at constant speed, list and graph ordered pairs of distances and times, and write the equation d = 65t to represent the relationship between distance and time."}], "standard_slug": "C", "text": "C"}], "standard_slug": "EE", "text": "Expressions & Equations"}, {"children": [{"retrieved": "2016-12-31 23:38:50.837264", "children": [{"retrieved": "2016-12-31 23:38:50.837264", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.6.G.A.1 Find the area of right triangles, other triangles, special quadrilaterals, and polygons by composing into rectangles or decomposing into triangles and other shapes; apply these techniques in the context of solving real-world and mathematical problems."}, {"retrieved": "2016-12-31 23:38:50.837264", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.6.G.A.2 Find the volume of a right rectangular prism with fractional edge lengths by packing it with unit cubes of the appropriate unit fraction edge lengths, and show that the volume is the same as would be found by multiplying the edge lengths of the prism. Apply the formulas V = l w h and V = b h to find volumes of right rectangular prisms with fractional edge lengths in the context of solving real-world and mathematical problems."}, {"retrieved": "2016-12-31 23:38:50.837264", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.6.G.A.3 Draw polygons in the coordinate plane given coordinates for the vertices; use coordinates to find the length of a side joining points with the same first coordinate or the same second coordinate. Apply these techniques in the context of solving real-world and mathematical problems."}, {"retrieved": "2016-12-31 23:38:50.837264", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.6.G.A.4 Represent three-dimensional figures using nets made up of rectangles and triangles, and use the nets to find the surface area of these figures. Apply these techniques in the context of solving real-world and mathematical problems."}], "standard_slug": "A", "text": "A"}], "standard_slug": "G", "text": "Geometry"}, {"children": [{"retrieved": "2016-12-31 23:38:51.118761", "children": [{"retrieved": "2016-12-31 23:38:51.118761", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.6.SP.A.1 Recognize a statistical question as one that anticipates variability in the data related to the question and accounts for it in the answers. For example, \"How old am I?\" is not a statistical question, but \"How old are the students in my school?\" is a statistical question because one anticipates variability in students' ages ."}, {"retrieved": "2016-12-31 23:38:51.118761", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.6.SP.A.2 Understand that a set of data collected to answer a statistical question has a distribution which can be described by its center, spread, and overall shape."}, {"retrieved": "2016-12-31 23:38:51.118761", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.6.SP.A.3 Recognize that a measure of center for a numerical data set summarizes all of its values with a single number, while a measure of variation describes how its values vary with a single number."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:51.118761", "children": [{"retrieved": "2016-12-31 23:38:51.118761", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.6.SP.B.4 Display numerical data in plots on a number line, including dot plots, histograms, and box plots."}, {"retrieved": "2016-12-31 23:38:51.118761", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.6.SP.B.5 Summarize numerical data sets in relation to their context, such as by:"}], "standard_slug": "B", "text": "B"}], "standard_slug": "SP", "text": "Statistics & Probability"}], "standard_slug": "6", "text": "Grade 6"}