{"children": [{"retrieved": "2016-12-31 23:39:16.008032", "children": [{"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "a", "text": "CCSS.ELA-Literacy.SL.9-10.1.a Come to discussions prepared, having read and researched material under study; explicitly draw on that preparation by referring to evidence from texts and other research on the topic or issue to stimulate a thoughtful, well-reasoned exchange of ideas."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "b", "text": "CCSS.ELA-Literacy.SL.9-10.1.b Work with peers to set rules for collegial discussions and decision-making (e.g., informal consensus, taking votes on key issues, presentation of alternate views), clear goals and deadlines, and individual roles as needed."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "c", "text": "CCSS.ELA-Literacy.SL.9-10.1.c Propel conversations by posing and responding to questions that relate the current discussion to broader themes or larger ideas; actively incorporate others into the discussion; and clarify, verify, or challenge ideas and conclusions."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "d", "text": "CCSS.ELA-Literacy.SL.9-10.1.d Respond thoughtfully to diverse perspectives, summarize points of agreement and disagreement, and, when warranted, qualify or justify their own views and understanding and make new connections in light of the evidence and reasoning presented."}], "standard_slug": "1", "text": "CCSS.ELA-Literacy.SL.9-10.1 Initiate and participate effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 9-10 topics, texts, and issues, building on others' ideas and expressing their own clearly and persuasively."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "2", "text": "CCSS.ELA-Literacy.SL.9-10.2 Integrate multiple sources of information presented in diverse media or formats (e.g., visually, quantitatively, orally) evaluating the credibility and accuracy of each source."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "3", "text": "CCSS.ELA-Literacy.SL.9-10.3 Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric, identifying any fallacious reasoning or exaggerated or distorted evidence."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "4", "text": "CCSS.ELA-Literacy.SL.9-10.4 Present information, findings, and supporting evidence clearly, concisely, and logically such that listeners can follow the line of reasoning and the organization, development, substance, and style are appropriate to purpose, audience, and task."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "5", "text": "CCSS.ELA-Literacy.SL.9-10.5 Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest."}, {"retrieved": "2016-12-31 23:39:16.008032", "children": [], "standard_slug": "6", "text": "CCSS.ELA-Literacy.SL.9-10.6 Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grades 9-10 Language standards 1 and 3 here for specific expectations.)"}], "standard_slug": "9-10", "text": "Grade 9-10"}