{"text": "Highschool: Statistics & Probability", "children": [{"text": "Interpreting Categorical & Quantitative Data", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.HSS.ID.A.1 Represent data with plots on the real number line (dot plots, histograms, and box plots).", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "CCSS.Math.Content.HSS.ID.A.2 Use statistics appropriate to the shape of the data distribution to compare center (median, mean) and spread (interquartile range, standard deviation) of two or more different data sets.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "CCSS.Math.Content.HSS.ID.A.3 Interpret differences in shape, center, and spread in the context of the data sets, accounting for possible effects of extreme data points (outliers).", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "CCSS.Math.Content.HSS.ID.A.4 Use the mean and standard deviation of a data set to fit it to a normal distribution and to estimate population percentages. Recognize that there are data sets for which such a procedure is not appropriate. Use calculators, spreadsheets, and tables to estimate areas under the normal curve.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:58.514018"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.HSS.ID.B.5 Summarize categorical data for two categories in two-way frequency tables. Interpret relative frequencies in the context of the data (including joint, marginal, and conditional relative frequencies). Recognize possible associations and trends in the data.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "CCSS.Math.Content.HSS.ID.B.6 Represent data on two quantitative variables on a scatter plot, and describe how the variables are related.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:58.514018"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "C", "children": [{"text": "CCSS.Math.Content.HSS.ID.C.7 Interpret the slope (rate of change) and the intercept (constant term) of a linear model in the context of the data.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "CCSS.Math.Content.HSS.ID.C.8 Compute (using technology) and interpret the correlation coefficient of a linear fit.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:38:58.514018"}, {"text": "CCSS.Math.Content.HSS.ID.C.9 Distinguish between correlation and causation.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:38:58.514018"}], "standard_slug": "C", "retrieved": "2016-12-31 23:38:58.514018"}], "standard_slug": "ID"}, {"text": "Making Inferences & Justifying Conclusions", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.HSS.IC.A.1 Understand statistics as a process for making inferences about population parameters based on a random sample from that population.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:58.697571"}, {"text": "CCSS.Math.Content.HSS.IC.A.2 Decide if a specified model is consistent with results from a given data-generating process, e.g., using simulation. For example, a model says a spinning coin falls heads up with probability 0.5. Would a result of 5 tails in a row cause you to question the model ?", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:58.697571"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:58.697571"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.HSS.IC.B.3 Recognize the purposes of and differences among sample surveys, experiments, and observational studies; explain how randomization relates to each.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:58.697571"}, {"text": "CCSS.Math.Content.HSS.IC.B.4 Use data from a sample survey to estimate a population mean or proportion; develop a margin of error through the use of simulation models for random sampling.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:58.697571"}, {"text": "CCSS.Math.Content.HSS.IC.B.5 Use data from a randomized experiment to compare two treatments; use simulations to decide if differences between parameters are significant.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:58.697571"}, {"text": "CCSS.Math.Content.HSS.IC.B.6 Evaluate reports based on data.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:58.697571"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:58.697571"}], "standard_slug": "IC"}, {"text": "Conditional Probability & the Rules of Probability", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.HSS.CP.A.1 Describe events as subsets of a sample space (the set of outcomes) using characteristics (or categories) of the outcomes, or as unions, intersections, or complements of other events (\"or,\" \"and,\" \"not\").", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.A.2 Understand that two events A and B are independent if the probability of A and B occurring together is the product of their probabilities, and use this characterization to determine if they are independent.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.A.3 Understand the conditional probability of A given B as P ( A and B )/ P ( B ), and interpret independence of A and B as saying that the conditional probability of A given B is the same as the probability of A , and the conditional probability of B given A is the same as the probability of B .", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.A.4 Construct and interpret two-way frequency tables of data when two categories are associated with each object being classified. Use the two-way table as a sample space to decide if events are independent and to approximate conditional probabilities. For example, collect data from a random sample of students in your school on their favorite subject among math, science, and English. Estimate the probability that a randomly selected student from your school will favor science given that the student is in tenth grade. Do the same for other subjects and compare the results.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.A.5 Recognize and explain the concepts of conditional probability and independence in everyday language and everyday situations. For example, compare the chance of having lung cancer if you are a smoker with the chance of being a smoker if you have lung cancer.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:59.937750"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.HSS.CP.B.6 Find the conditional probability of A given B as the fraction of B 's outcomes that also belong to A , and interpret the answer in terms of the model.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.B.7 Apply the Addition Rule, P(A or B) = P(A) + P(B) - P(A and B), and interpret the answer in terms of the model.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.B.8 (+) Apply the general Multiplication Rule in a uniform probability model, P(A and B) = P(A)P(B|A) = P(B)P(A|B), and interpret the answer in terms of the model.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:38:59.937750"}, {"text": "CCSS.Math.Content.HSS.CP.B.9 (+) Use permutations and combinations to compute probabilities of compound events and solve problems.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:38:59.937750"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:59.937750"}], "standard_slug": "CP"}, {"text": "Using Probability to Make Decisions", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.HSS.MD.A.1 (+) Define a random variable for a quantity of interest by assigning a numerical value to each event in a sample space; graph the corresponding probability distribution using the same graphical displays as for data distributions.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:39:00.138391"}, {"text": "CCSS.Math.Content.HSS.MD.A.2 (+) Calculate the expected value of a random variable; interpret it as the mean of the probability distribution.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:00.138391"}, {"text": "CCSS.Math.Content.HSS.MD.A.3 (+) Develop a probability distribution for a random variable defined for a sample space in which theoretical probabilities can be calculated; find the expected value. For example, find the theoretical probability distribution for the number of correct answers obtained by guessing on all five questions of a multiple-choice test where each question has four choices, and find the expected grade under various grading schemes.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:00.138391"}, {"text": "CCSS.Math.Content.HSS.MD.A.4 (+) Develop a probability distribution for a random variable defined for a sample space in which probabilities are assigned empirically; find the expected value. For example, find a current data distribution on the number of TV sets per household in the United States, and calculate the expected number of sets per household. How many TV sets would you expect to find in 100 randomly selected households?", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:00.138391"}], "standard_slug": "A", "retrieved": "2016-12-31 23:39:00.138391"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.HSS.MD.B.5 (+) Weigh the possible outcomes of a decision by assigning probabilities to payoff values and finding expected values.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:00.138391"}, {"text": "CCSS.Math.Content.HSS.MD.B.6 (+) Use probabilities to make fair decisions (e.g., drawing by lots, using a random number generator).", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:00.138391"}, {"text": "CCSS.Math.Content.HSS.MD.B.7 (+) Analyze decisions and strategies using probability concepts (e.g., product testing, medical testing, pulling a hockey goalie at the end of a game).", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:00.138391"}], "standard_slug": "B", "retrieved": "2016-12-31 23:39:00.138391"}], "standard_slug": "MD"}], "standard_slug": "HSS"}