{"text": "Grade 4", "children": [{"text": "CCSS.ELA-Literacy.SL.4.1 Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 4 topics and texts , building on others' ideas and expressing their own clearly.", "children": [{"text": "CCSS.ELA-Literacy.SL.4.1.a Come to discussions prepared, having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.1.b Follow agreed-upon rules for discussions and carry out assigned roles.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.1.c Pose and respond to specific questions to clarify or follow up on information, and make comments that contribute to the discussion and link to the remarks of others.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.1.d Review the key ideas expressed and explain their own ideas and understanding in light of the discussion.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:14.844652"}], "standard_slug": "1", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.2 Paraphrase portions of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.3 Identify the reasons and evidence a speaker provides to support particular points.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.4 Report on a topic or text, tell a story, or recount an experience in an organized manner, using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.5 Add audio recordings and visual displays to presentations when appropriate to enhance the development of main ideas or themes.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:14.844652"}, {"text": "CCSS.ELA-Literacy.SL.4.6 Differentiate between contexts that call for formal English (e.g., presenting ideas) and situations where informal discourse is appropriate (e.g., small-group discussion); use formal English when appropriate to task and situation. (See grade 4 Language standards 1 here for specific expectations.)", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:14.844652"}], "standard_slug": "4"}