{"text": "Geometry", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.7.G.A.1 Solve problems involving scale drawings of geometric figures, including computing actual lengths and areas from a scale drawing and reproducing a scale drawing at a different scale.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:51.918989"}, {"text": "CCSS.Math.Content.7.G.A.2 Draw (freehand, with ruler and protractor, and with technology) geometric shapes with given conditions. Focus on constructing triangles from three measures of angles or sides, noticing when the conditions determine a unique triangle, more than one triangle, or no triangle.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:51.918989"}, {"text": "CCSS.Math.Content.7.G.A.3 Describe the two-dimensional figures that result from slicing three-dimensional figures, as in plane sections of right rectangular prisms and right rectangular pyramids.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:51.918989"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:51.918989"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.7.G.B.4 Know the formulas for the area and circumference of a circle and use them to solve problems; give an informal derivation of the relationship between the circumference and area of a circle.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:51.918989"}, {"text": "CCSS.Math.Content.7.G.B.5 Use facts about supplementary, complementary, vertical, and adjacent angles in a multi-step problem to write and solve simple equations for an unknown angle in a figure.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:51.918989"}, {"text": "CCSS.Math.Content.7.G.B.6 Solve real-world and mathematical problems involving area, volume and surface area of two- and three-dimensional objects composed of triangles, quadrilaterals, polygons, cubes, and right prisms.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:51.918989"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:51.918989"}], "standard_slug": "G"}