{"children": [{"retrieved": "2016-12-31 23:39:15.436610", "children": [{"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "a", "text": "CCSS.ELA-Literacy.SL.7.1.a Come to discussions prepared, having read or researched material under study; explicitly draw on that preparation by referring to evidence on the topic, text, or issue to probe and reflect on ideas under discussion."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "b", "text": "CCSS.ELA-Literacy.SL.7.1.b Follow rules for collegial discussions, track progress toward specific goals and deadlines, and define individual roles as needed."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "c", "text": "CCSS.ELA-Literacy.SL.7.1.c Pose questions that elicit elaboration and respond to others' questions and comments with relevant observations and ideas that bring the discussion back on topic as needed."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "d", "text": "CCSS.ELA-Literacy.SL.7.1.d Acknowledge new information expressed by others and, when warranted, modify their own views."}], "standard_slug": "1", "text": "CCSS.ELA-Literacy.SL.7.1 Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 7 topics, texts, and issues, building on others' ideas and expressing their own clearly."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "2", "text": "CCSS.ELA-Literacy.SL.7.2 Analyze the main ideas and supporting details presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how the ideas clarify a topic, text, or issue under study."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "3", "text": "CCSS.ELA-Literacy.SL.7.3 Delineate a speaker's argument and specific claims, evaluating the soundness of the reasoning and the relevance and sufficiency of the evidence."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "4", "text": "CCSS.ELA-Literacy.SL.7.4 Present claims and findings, emphasizing salient points in a focused, coherent manner with pertinent descriptions, facts, details, and examples; use appropriate eye contact, adequate volume, and clear pronunciation."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "5", "text": "CCSS.ELA-Literacy.SL.7.5 Include multimedia components and visual displays in presentations to clarify claims and findings and emphasize salient points."}, {"retrieved": "2016-12-31 23:39:15.437101", "children": [], "standard_slug": "6", "text": "CCSS.ELA-Literacy.SL.7.6 Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate. (See grade 7 Language standards 1 and 3 here for specific expectations.)"}], "standard_slug": "7", "text": "Grade 7"}