{"text": "Number & Operations in Base Ten", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.1.NBT.A.1 Count to 120, starting at any number less than 120. In this range, read and write numerals and represent a number of objects with a written numeral.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:43.092964"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:43.092964"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.1.NBT.B.2 Understand that the two digits of a two-digit number represent amounts of tens and ones. Understand the following as special cases:", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:43.092964"}, {"text": "CCSS.Math.Content.1.NBT.B.3 Compare two two-digit numbers based on meanings of the tens and ones digits, recording the results of comparisons with the symbols >, =, and <.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:43.092964"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:43.092964"}, {"text": "C", "children": [{"text": "CCSS.Math.Content.1.NBT.C.4 Add within 100, including adding a two-digit number and a one-digit number, and adding a two-digit number and a multiple of 10, using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used. Understand that in adding two-digit numbers, one adds tens and tens, ones and ones; and sometimes it is necessary to compose a ten.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:43.092964"}, {"text": "CCSS.Math.Content.1.NBT.C.5 Given a two-digit number, mentally find 10 more or 10 less than the number, without having to count; explain the reasoning used.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:43.092964"}, {"text": "CCSS.Math.Content.1.NBT.C.6 Subtract multiples of 10 in the range 10-90 from multiples of 10 in the range 10-90 (positive or zero differences), using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:43.092964"}], "standard_slug": "C", "retrieved": "2016-12-31 23:38:43.092964"}], "standard_slug": "NBT"}