{"text": "Grade 9-10", "children": [{"text": "CCSS.ELA-Literacy.RST.9-10.1 Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.2 Determine the central ideas or conclusions of a text; trace the text's explanation or depiction of a complex process, phenomenon, or concept; provide an accurate summary of the text.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.3 Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks, attending to special cases or exceptions defined in the text.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.4 Determine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to grades 9-10 texts and topics .", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.5 Analyze the structure of the relationships among concepts in a text, including relationships among key terms (e.g., force, friction, reaction force, energy ).", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.6 Analyze the author's purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, defining the question the author seeks to address.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.7 Translate quantitative or technical information expressed in words in a text into visual form (e.g., a table or chart) and translate information expressed visually or mathematically (e.g., in an equation) into words.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.8 Assess the extent to which the reasoning and evidence in a text support the author's claim or a recommendation for solving a scientific or technical problem.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.9 Compare and contrast findings presented in a text to those from other sources (including their own experiments), noting when the findings support or contradict previous explanations or accounts.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:39:19.157545"}, {"text": "CCSS.ELA-Literacy.RST.9-10.10 By the end of grade 10, read and comprehend science/technical texts in the grades 9-10 text complexity band independently and proficiently.", "children": [], "standard_slug": "10", "retrieved": "2016-12-31 23:39:19.157545"}], "standard_slug": "9-10"}