[{"text": "CCSS.ELA-Literacy.RL.9-10.1 Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.2 Determine a theme or central idea of a text and analyze in detail its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.3 Analyze how complex characters (e.g., those with multiple or conflicting motivations) develop over the course of a text, interact with other characters, and advance the plot or develop the theme.", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.4 Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language evokes a sense of time and place; how it sets a formal or informal tone).", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.5 Analyze how an author's choices concerning how to structure a text, order events within it (e.g., parallel plots), and manipulate time (e.g., pacing, flashbacks) create such effects as mystery, tension, or surprise.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.6 Analyze a particular point of view or cultural experience reflected in a work of literature from outside the United States, drawing on a wide reading of world literature.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.7 Analyze the representation of a subject or a key scene in two different artistic mediums, including what is emphasized or absent in each treatment (e.g., Auden's \"Musée des Beaux Arts\" and Breughel's Landscape with the Fall of Icarus).", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.8 (RL.9-10.8 not applicable to literature)", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.9 Analyze how an author draws on and transforms source material in a specific work (e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare).", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:02.919034"}, {"text": "CCSS.ELA-Literacy.RL.9-10.10 By the end of grade 9, read and comprehend literature, including stories, dramas, and poems, in the grades 9-10 text complexity band proficiently, with scaffolding as needed at the high end of the range.  By the end of grade 10, read and comprehend literature, including stories, dramas, and poems, at the high end of the grades 9-10 text complexity band independently and proficiently.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:02.919034"}]