{"text": "Grade 9-10", "children": [{"text": "CCSS.ELA-Literacy.RI.9-10.1 Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.2 Determine a central idea of a text and analyze its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.3 Analyze how the author unfolds an analysis or series of ideas or events, including the order in which the points are made, how they are introduced and developed, and the connections that are drawn between them.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.4 Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language of a court opinion differs from that of a newspaper).", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.5 Analyze in detail how an author's ideas or claims are developed and refined by particular sentences, paragraphs, or larger portions of a text (e.g., a section or chapter).", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.6 Determine an author's point of view or purpose in a text and analyze how an author uses rhetoric to advance that point of view or purpose.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.7 Analyze various accounts of a subject told in different mediums (e.g., a person's life story in both print and multimedia), determining which details are emphasized in each account.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.8 Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is valid and the evidence is relevant and sufficient; identify false statements and fallacious reasoning.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.9 Analyze seminal U.S. documents of historical and literary significance  (e.g., Washington's Farewell Address, the Gettysburg Address, Roosevelt's Four Freedoms speech, King's \"Letter from Birmingham Jail\"), including how they address related themes and concepts.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:39:10.173551"}, {"text": "CCSS.ELA-Literacy.RI.9-10.10 By the end of grade 9, read and comprehend literary nonfiction in the grades 9-10 text complexity band proficiently, with scaffolding as needed at the high end of the range.\r\n\r\nBy the end of grade 10, read and comprehend literary nonfiction at the high end of the grades 9-10 text complexity band independently and proficiently.", "children": [], "standard_slug": "10", "retrieved": "2016-12-31 23:39:10.173551"}], "standard_slug": "9-10"}