{"children": [{"children": [{"retrieved": "2016-12-31 23:38:45.794325", "children": [{"retrieved": "2016-12-31 23:38:45.794325", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.4.OA.A.1 Interpret a multiplication equation as a comparison, e.g., interpret 35 = 5 × 7 as a statement that 35 is 5 times as many as 7 and 7 times as many as 5. Represent verbal statements of multiplicative comparisons as multiplication equations."}, {"retrieved": "2016-12-31 23:38:45.794325", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.4.OA.A.2 Multiply or divide to solve word problems involving multiplicative comparison, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem, distinguishing multiplicative comparison from additive comparison."}, {"retrieved": "2016-12-31 23:38:45.794325", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.4.OA.A.3 Solve multistep word problems posed with whole numbers and having whole-number answers using the four operations, including problems in which remainders must be interpreted. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:45.794325", "children": [{"retrieved": "2016-12-31 23:38:45.794325", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.4.OA.B.4 Find all factor pairs for a whole number in the range 1-100. Recognize that a whole number is a multiple of each of its factors. Determine whether a given whole number in the range 1-100 is a multiple of a given one-digit number. Determine whether a given whole number in the range 1-100 is prime or composite."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:45.794325", "children": [{"retrieved": "2016-12-31 23:38:45.794325", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.4.OA.C.5 Generate a number or shape pattern that follows a given rule. Identify apparent features of the pattern that were not explicit in the rule itself. For example, given the rule \"Add 3\" and the starting number 1, generate terms in the resulting sequence and observe that the terms appear to alternate between odd and even numbers. Explain informally why the numbers will continue to alternate in this way ."}], "standard_slug": "C", "text": "C"}], "standard_slug": "OA", "text": "Operations & Algebraic Thinking"}, {"children": [{"retrieved": "2016-12-31 23:38:45.976143", "children": [{"retrieved": "2016-12-31 23:38:45.976143", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.4.NBT.A.1 Recognize that in a multi-digit whole number, a digit in one place represents ten times what it represents in the place to its right. For example, recognize that 700 ÷ 70 = 10 by applying concepts of place value and division ."}, {"retrieved": "2016-12-31 23:38:45.976143", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.4.NBT.A.2 Read and write multi-digit whole numbers using base-ten numerals, number names, and expanded form. Compare two multi-digit numbers based on meanings of the digits in each place, using >, =, and < symbols to record the results of comparisons."}, {"retrieved": "2016-12-31 23:38:45.976143", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.4.NBT.A.3 Use place value understanding to round multi-digit whole numbers to any place."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:45.976143", "children": [{"retrieved": "2016-12-31 23:38:45.976143", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.4.NBT.B.4 Fluently add and subtract multi-digit whole numbers using the standard algorithm."}, {"retrieved": "2016-12-31 23:38:45.976143", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.4.NBT.B.5 Multiply a whole number of up to four digits by a one-digit whole number, and multiply two two-digit numbers, using strategies based on place value and the properties of operations. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."}, {"retrieved": "2016-12-31 23:38:45.976143", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.4.NBT.B.6 Find whole-number quotients and remainders with up to four-digit dividends and one-digit divisors, using strategies based on place value, the properties of operations, and/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."}], "standard_slug": "B", "text": "B"}], "standard_slug": "NBT", "text": "Number & Operations in Base Ten"}, {"children": [], "standard_slug": "NFA", "text": "Numbers & Operations—Fractions"}, {"children": [{"retrieved": "2016-12-31 23:38:47.350397", "children": [{"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.4.MD.A.1 Know relative sizes of measurement units within one system of units including km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec. Within a single system of measurement, express measurements in a larger unit in terms of a smaller unit. Record measurement equivalents in a two-column table. For example, know that 1 ft is 12 times as long as 1 in. Express the length of a 4 ft snake as 48 in. Generate a conversion table for feet and inches listing the number pairs (1, 12), (2, 24), (3, 36), ..."}, {"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.4.MD.A.2 Use the four operations to solve word problems involving distances, intervals of time, liquid volumes, masses of objects, and money, including problems involving simple fractions or decimals, and problems that require expressing measurements given in a larger unit in terms of a smaller unit. Represent measurement quantities using diagrams such as number line diagrams that feature a measurement scale."}, {"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.4.MD.A.3 Apply the area and perimeter formulas for rectangles in real world and mathematical problems. For example, find the width of a rectangular room given the area of the flooring and the length, by viewing the area formula as a multiplication equation with an unknown factor ."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:47.350397", "children": [{"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.4.MD.B.4 Make a line plot to display a data set of measurements in fractions of a unit (1/2, 1/4, 1/8). Solve problems involving addition and subtraction of fractions by using information presented in line plots. For example, from a line plot find and interpret the difference in length between the longest and shortest specimens in an insect collection ."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:47.350397", "children": [{"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.4.MD.C.5 Recognize angles as geometric shapes that are formed wherever two rays share a common endpoint, and understand concepts of angle measurement:"}, {"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.4.MD.C.6 Measure angles in whole-number degrees using a protractor. Sketch angles of specified measure."}, {"retrieved": "2016-12-31 23:38:47.350397", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.4.MD.C.7 Recognize angle measure as additive. When an angle is decomposed into non-overlapping parts, the angle measure of the whole is the sum of the angle measures of the parts. Solve addition and subtraction problems to find unknown angles on a diagram in real world and mathematical problems, e.g., by using an equation with a symbol for the unknown angle measure."}], "standard_slug": "C", "text": "C"}], "standard_slug": "MD", "text": "Measurement & Data"}, {"children": [{"retrieved": "2016-12-31 23:38:48.779469", "children": [{"retrieved": "2016-12-31 23:38:48.779469", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.4.G.A.1 Draw points, lines, line segments, rays, angles (right, acute, obtuse), and perpendicular and parallel lines. Identify these in two-dimensional figures."}, {"retrieved": "2016-12-31 23:38:48.779469", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.4.G.A.2 Classify two-dimensional figures based on the presence or absence of parallel or perpendicular lines, or the presence or absence of angles of a specified size. Recognize right triangles as a category, and identify right triangles."}, {"retrieved": "2016-12-31 23:38:48.779469", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.4.G.A.3 Recognize a line of symmetry for a two-dimensional figure as a line across the figure such that the figure can be folded along the line into matching parts. Identify line-symmetric figures and draw lines of symmetry."}], "standard_slug": "A", "text": "A"}], "standard_slug": "G", "text": "Geometry"}], "standard_slug": "4", "text": "Grade 4"}