[{"text": "CCSS.ELA-Literacy.RI.6.1 Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.2 Determine a central idea of a text and how it is conveyed through particular details; provide a summary of the text distinct from personal opinions or judgments.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.3 Analyze in detail how a key individual, event, or idea is introduced, illustrated, and elaborated in a text (e.g., through examples or anecdotes).", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.4 Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings.", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.5 Analyze how a particular sentence, paragraph, chapter, or section fits into the overall structure of a text and contributes to the development of the ideas.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.6 Determine an author's point of view or purpose in a text and explain how it is conveyed in the text.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.7 Integrate information presented in different media or formats (e.g., visually, quantitatively) as well as in words to develop a coherent understanding of a topic or issue.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.8 Trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not.", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.9 Compare and contrast one author's presentation of events with that of another (e.g., a memoir written by and a biography on the same person).", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:09.191020"}, {"text": "CCSS.ELA-Literacy.RI.6.10 By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:09.191020"}]