[{"text": "CCSS.ELA-Literacy.RI.5.1 Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.2 Determine two or more main ideas of a text and explain how they are supported by key details; summarize the text.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.3 Explain the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text.", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.4 Determine the meaning of general academic and domain-specific words and phrases in a text relevant to a grade 5 topic or subject area .", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.5 Compare and contrast the overall structure (e.g., chronology, comparison, cause/effect, problem/solution) of events, ideas, concepts, or information in two or more texts.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.6 Analyze multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.7 Draw on information from multiple print or digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.8 Explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point(s).", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.9 Integrate information from several texts on the same topic in order to write or speak about the subject knowledgeably.", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:08.857061"}, {"text": "CCSS.ELA-Literacy.RI.5.10 By the end of the year, read and comprehend informational texts, including history/social studies, science, and technical texts, at the high end of the grades 4-5 text complexity band independently and proficiently.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:08.857061"}]