[{"text": "CCSS.ELA-Literacy.RL.8.1 Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.2 Determine a theme or central idea of a text and analyze its development over the course of the text, including its relationship to the characters, setting, and plot; provide an objective summary of the text.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.3 Analyze how particular lines of dialogue or incidents in a story or drama propel the action, reveal aspects of a character, or provoke a decision.", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.4 Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts.", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.5 Compare and contrast the structure of two or more texts and analyze how the differing structure of each text contributes to its meaning and style.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.6 Analyze how differences in the points of view of the characters and the audience or reader (e.g., created through the use of dramatic irony) create such effects as suspense or humor.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.7 Analyze the extent to which a filmed or live production of a story or drama stays faithful to or departs from the text or script, evaluating the choices made by the director or actors.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.8 (RL.8.8 not applicable to literature)", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.9 Analyze how a modern work of fiction draws on themes, patterns of events, or character types from myths, traditional stories, or religious works such as the Bible, including describing how the material is rendered new.", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:02.752531"}, {"text": "CCSS.ELA-Literacy.RL.8.10 By the end of the year, read and comprehend literature, including stories, dramas, and poems, at the high end of grades 6-8 text complexity band independently and proficiently.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:02.752531"}]