{"text": "Grade 11-12", "children": [{"text": "CCSS.ELA-Literacy.RST.11-12.1 Cite specific textual evidence to support analysis of science and technical texts, attending to important distinctions the author makes and to any gaps or inconsistencies in the account.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.2 Determine the central ideas or conclusions of a text; summarize complex concepts, processes, or information presented in a text by paraphrasing them in simpler but still accurate terms.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.3 Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks; analyze the specific results based on explanations in the text.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.4 Determine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to grades 11-12 texts and topics .", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.5 Analyze how the text structures information or ideas into categories or hierarchies, demonstrating understanding of the information or ideas.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.6 Analyze the author's purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, identifying important issues that remain unresolved.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.7 Integrate and evaluate multiple sources of information presented in diverse formats and media (e.g., quantitative data, video, multimedia) in order to address a question or solve a problem.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.8 Evaluate the hypotheses, data, analysis, and conclusions in a science or technical text, verifying the data when possible and corroborating or challenging conclusions with other sources of information.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.9 Synthesize information from a range of sources (e.g., texts, experiments, simulations) into a coherent understanding of a process, phenomenon, or concept, resolving conflicting information when possible.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:39:19.322158"}, {"text": "CCSS.ELA-Literacy.RST.11-12.10 By the end of grade 12, read and comprehend science/technical texts in the grades 11-CCR text complexity band independently and proficiently.", "children": [], "standard_slug": "10", "retrieved": "2016-12-31 23:39:19.322158"}], "standard_slug": "11-12"}