[{"text": "CCSS.ELA-Literacy.RL.11-12.1 Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain.", "children": 0, "standard_slug": "1", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.2 Determine two or more themes or central ideas of a text and analyze their development over the course of the text, including how they interact and build on one another to produce a complex account; provide an objective summary of the text.", "children": 0, "standard_slug": "2", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.3 Analyze the impact of the author's choices regarding how to develop and relate elements of a story or drama (e.g., where a story is set, how the action is ordered, how the characters are introduced and developed).", "children": 0, "standard_slug": "3", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.4 Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including words with multiple meanings or language that is particularly fresh, engaging, or beautiful. (Include Shakespeare as well as other authors.)", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.5 Analyze how an author's choices concerning how to structure specific parts of a text (e.g., the choice of where to begin or end a story, the choice to provide a comedic or tragic resolution) contribute to its overall structure and meaning as well as its aesthetic impact.", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.6 Analyze a case in which grasping a point of view requires distinguishing what is directly stated in a text from what is really meant (e.g., satire, sarcasm, irony, or understatement).", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.7 Analyze multiple interpretations of a story, drama, or poem (e.g., recorded or live production of a play or recorded novel or poetry), evaluating how each version interprets the source text. (Include at least one play by Shakespeare and one play by an American dramatist.)", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.8 (RL.11-12.8 not applicable to literature)", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.9 Demonstrate knowledge of eighteenth-, nineteenth- and early-twentieth-century foundational works of American literature, including how two or more texts from the same period treat similar themes or topics.", "children": 0, "standard_slug": "9", "retrieved": "2016-12-31 23:39:03.248965"}, {"text": "CCSS.ELA-Literacy.RL.11-12.10 By the end of grade 11, read and comprehend literature, including stories, dramas, and poems, in the grades 11-CCR text complexity band proficiently, with scaffolding as needed at the high end of the range.  By the end of grade 12, read and comprehend literature, including stories, dramas, and poems, at the high end of the grades 11-CCR text complexity band independently and proficiently.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:03.248965"}]