{"text": "Grade 11-12", "children": [{"text": "CCSS.ELA-Literacy.SL.11-12.1 Initiate and participate effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 11-12 topics, texts, and issues, building on others' ideas and expressing their own clearly and persuasively.", "children": [{"text": "CCSS.ELA-Literacy.SL.11-12.1.a Come to discussions prepared, having read and researched material under study; explicitly draw on that preparation by referring to evidence from texts and other research on the topic or issue to stimulate a thoughtful, well-reasoned exchange of ideas.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.1.b Work with peers to promote civil, democratic discussions and decision-making, set clear goals and deadlines, and establish individual roles as needed.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.1.c Propel conversations by posing and responding to questions that probe reasoning and evidence; ensure a hearing for a full range of positions on a topic or issue; clarify, verify, or challenge ideas and conclusions; and promote divergent and creative perspectives.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.1.d Respond thoughtfully to diverse perspectives; synthesize comments, claims, and evidence made on all sides of an issue; resolve contradictions when possible; and determine what additional information or research is required to deepen the investigation or complete the task.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:16.172291"}], "standard_slug": "1", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.2 Integrate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, orally) in order to make informed decisions and solve problems, evaluating the credibility and accuracy of each source and noting any discrepancies among the data.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.3 Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric, assessing the stance, premises, links among ideas, word choice, points of emphasis, and tone used.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.4 Present information, findings, and supporting evidence, conveying a clear and distinct perspective, such that listeners can follow the line of reasoning, alternative or opposing perspectives are addressed, and the organization, development, substance, and style are appropriate to purpose, audience, and a range of formal and informal tasks.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.5 Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:16.172291"}, {"text": "CCSS.ELA-Literacy.SL.11-12.6 Adapt speech to a variety of contexts and tasks, demonstrating a command of formal English when indicated or appropriate. (See grades 11-12 Language standards 1 and 3 here for specific expectations.)", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:16.172291"}], "standard_slug": "11-12"}