{"text": "Grade 3", "children": [{"text": "CCSS.ELA-Literacy.SL.3.1 Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 3 topics and texts , building on others' ideas and expressing their own clearly.", "children": [{"text": "CCSS.ELA-Literacy.SL.3.1.a Come to discussions prepared, having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.1.b Follow agreed-upon rules for discussions (e.g., gaining the floor in respectful ways, listening to others with care, speaking one at a time about the topics and texts under discussion).", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.1.c Ask questions to check understanding of information presented, stay on topic, and link their comments to the remarks of others.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.1.d Explain their own ideas and understanding in light of the discussion.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:14.547945"}], "standard_slug": "1", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.2 Determine the main ideas and supporting details of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.3 Ask and answer questions about information from a speaker, offering appropriate elaboration and detail.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.4 Report on a topic or text, tell a story, or recount an experience with appropriate facts and relevant, descriptive details, speaking clearly at an understandable pace.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.5 Create engaging audio recordings of stories or poems that demonstrate fluid reading at an understandable pace; add visual displays when appropriate to emphasize or enhance certain facts or details.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:14.547945"}, {"text": "CCSS.ELA-Literacy.SL.3.6 Speak in complete sentences when appropriate to task and situation in order to provide requested detail or clarification. (See grade 3 Language standards 1 and 3 here for specific expectations.)", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:14.547945"}], "standard_slug": "3"}