{"text": "CCSS.ELA-Literacy.WHST.11-12.2 Write informative/explanatory texts, including the narration of historical events, scientific procedures/experiments, or technical processes.", "children": [{"text": "CCSS.ELA-Literacy.WHST.11-12.2.a Introduce a topic and organize complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.2.b Develop the topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.2.c Use varied transitions and sentence structures to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.2.d Use precise language, domain-specific vocabulary and techniques such as metaphor, simile, and analogy to manage the complexity of the topic; convey a knowledgeable stance in a style that responds to the discipline and context as well as to the expertise of likely readers.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:20.068568"}, {"text": "CCSS.ELA-Literacy.WHST.11-12.2.e Provide a concluding statement or section that follows from and supports the information or explanation provided (e.g., articulating implications or the significance of the topic).", "children": [], "standard_slug": "e", "retrieved": "2016-12-31 23:39:20.068568"}], "standard_slug": "2", "retrieved": "2016-12-31 23:39:20.068568"}