[{"text": "CCSS.ELA-Literacy.W.7.1 Write arguments to support claims with clear reasons and relevant evidence.", "children": 5, "standard_slug": "1", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.2 Write informative/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content.", "children": 6, "standard_slug": "2", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.3 Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences.", "children": 5, "standard_slug": "3", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.4 Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.5 With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 7 here .)", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.6 Use technology, including the Internet, to produce and publish writing and link to and cite sources as well as to interact and collaborate with others, including linking to and citing sources.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.7 Conduct short research projects to answer a question, drawing on several sources and generating additional related, focused questions for further research and investigation.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.8 Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation.", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.9 Draw evidence from literary or informational texts to support analysis, reflection, and research.", "children": 2, "standard_slug": "9", "retrieved": "2016-12-31 23:39:13.058559"}, {"text": "CCSS.ELA-Literacy.W.7.10 Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:13.058559"}]