[{"text": "CCSS.ELA-Literacy.W.4.1 Write opinion pieces on topics or texts, supporting a point of view with reasons and information.", "children": 4, "standard_slug": "1", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.2 Write informative/explanatory texts to examine a topic and convey ideas and information clearly.", "children": 5, "standard_slug": "2", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.3 Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences.", "children": 5, "standard_slug": "3", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.4 Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1-3 above.)", "children": 0, "standard_slug": "4", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.5 With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, and editing. (Editing for conventions should demonstrate command of Language standards 1-3 up to and including grade 4 here .)", "children": 0, "standard_slug": "5", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.6 With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of one page in a single sitting.", "children": 0, "standard_slug": "6", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.7 Conduct short research projects that build knowledge through investigation of different aspects of a topic.", "children": 0, "standard_slug": "7", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.8 Recall relevant information from experiences or gather relevant information from print and digital sources; take notes and categorize information, and provide a list of sources.", "children": 0, "standard_slug": "8", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.9 Draw evidence from literary or informational texts to support analysis, reflection, and research.", "children": 2, "standard_slug": "9", "retrieved": "2016-12-31 23:39:12.549098"}, {"text": "CCSS.ELA-Literacy.W.4.10 Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences.", "children": 0, "standard_slug": "10", "retrieved": "2016-12-31 23:39:12.549098"}]