{"text": "Grade 9-10", "children": [{"text": "CCSS.ELA-Literacy.WHST.9-10.1 Write arguments focused on discipline-specific content .", "children": [{"text": "CCSS.ELA-Literacy.WHST.9-10.1.a Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among the claim(s), counterclaims, reasons, and evidence.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.1.b Develop claim(s) and counterclaims fairly, supplying data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form and in a manner that anticipates the audience's knowledge level and concerns.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.1.c Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.1.d Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.1.e Provide a concluding statement or section that follows from or supports the argument presented.", "children": [], "standard_slug": "e", "retrieved": "2016-12-31 23:39:19.681658"}], "standard_slug": "1", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.2 Write informative/explanatory texts, including the narration of historical events, scientific procedures/ experiments, or technical processes.", "children": [{"text": "CCSS.ELA-Literacy.WHST.9-10.2.a Introduce a topic and organize ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.", "children": [], "standard_slug": "a", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.2.b Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.", "children": [], "standard_slug": "b", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.2.c Use varied transitions and sentence structures to link the major sections of the text, create cohesion, and clarify the relationships among ideas and concepts.", "children": [], "standard_slug": "c", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.2.d Use precise language and domain-specific vocabulary to manage the complexity of the topic and convey a style appropriate to the discipline and context as well as to the expertise of likely readers.", "children": [], "standard_slug": "d", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.2.e Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.", "children": [], "standard_slug": "e", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.2.f Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic).", "children": [], "standard_slug": "f", "retrieved": "2016-12-31 23:39:19.681658"}], "standard_slug": "2", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.3 (See note; not applicable as a separate requirement)", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.4 Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.5 Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.6 Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology's capacity to link to other information and to display information flexibly and dynamically.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.7 Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.8 Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.9 Draw evidence from informational texts to support analysis, reflection, and research.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:39:19.681658"}, {"text": "CCSS.ELA-Literacy.WHST.9-10.10 Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences.", "children": [], "standard_slug": "10", "retrieved": "2016-12-31 23:39:19.681658"}], "standard_slug": "9-10"}