{"text": "Measurement & Data", "children": [{"text": "A", "children": [{"text": "CCSS.Math.Content.4.MD.A.1 Know relative sizes of measurement units within one system of units including km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec. Within a single system of measurement, express measurements in a larger unit in terms of a smaller unit. Record measurement equivalents in a two-column table. For example, know that 1 ft is 12 times as long as 1 in. Express the length of a 4 ft snake as 48 in. Generate a conversion table for feet and inches listing the number pairs (1, 12), (2, 24), (3, 36), ...", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:38:47.350397"}, {"text": "CCSS.Math.Content.4.MD.A.2 Use the four operations to solve word problems involving distances, intervals of time, liquid volumes, masses of objects, and money, including problems involving simple fractions or decimals, and problems that require expressing measurements given in a larger unit in terms of a smaller unit. Represent measurement quantities using diagrams such as number line diagrams that feature a measurement scale.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:38:47.350397"}, {"text": "CCSS.Math.Content.4.MD.A.3 Apply the area and perimeter formulas for rectangles in real world and mathematical problems. For example, find the width of a rectangular room given the area of the flooring and the length, by viewing the area formula as a multiplication equation with an unknown factor .", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:38:47.350397"}], "standard_slug": "A", "retrieved": "2016-12-31 23:38:47.350397"}, {"text": "B", "children": [{"text": "CCSS.Math.Content.4.MD.B.4 Make a line plot to display a data set of measurements in fractions of a unit (1/2, 1/4, 1/8). Solve problems involving addition and subtraction of fractions by using information presented in line plots. For example, from a line plot find and interpret the difference in length between the longest and shortest specimens in an insect collection .", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:38:47.350397"}], "standard_slug": "B", "retrieved": "2016-12-31 23:38:47.350397"}, {"text": "C", "children": [{"text": "CCSS.Math.Content.4.MD.C.5 Recognize angles as geometric shapes that are formed wherever two rays share a common endpoint, and understand concepts of angle measurement:", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:38:47.350397"}, {"text": "CCSS.Math.Content.4.MD.C.6 Measure angles in whole-number degrees using a protractor. Sketch angles of specified measure.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:38:47.350397"}, {"text": "CCSS.Math.Content.4.MD.C.7 Recognize angle measure as additive. When an angle is decomposed into non-overlapping parts, the angle measure of the whole is the sum of the angle measures of the parts. Solve addition and subtraction problems to find unknown angles on a diagram in real world and mathematical problems, e.g., by using an equation with a symbol for the unknown angle measure.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:38:47.350397"}], "standard_slug": "C", "retrieved": "2016-12-31 23:38:47.350397"}], "standard_slug": "MD"}