{"retrieved": "2016-12-31 23:39:19.681658", "children": [{"retrieved": "2016-12-31 23:39:19.681658", "children": [], "standard_slug": "a", "text": "CCSS.ELA-Literacy.WHST.9-10.2.a Introduce a topic and organize ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension."}, {"retrieved": "2016-12-31 23:39:19.681658", "children": [], "standard_slug": "b", "text": "CCSS.ELA-Literacy.WHST.9-10.2.b Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic."}, {"retrieved": "2016-12-31 23:39:19.681658", "children": [], "standard_slug": "c", "text": "CCSS.ELA-Literacy.WHST.9-10.2.c Use varied transitions and sentence structures to link the major sections of the text, create cohesion, and clarify the relationships among ideas and concepts."}, {"retrieved": "2016-12-31 23:39:19.681658", "children": [], "standard_slug": "d", "text": "CCSS.ELA-Literacy.WHST.9-10.2.d Use precise language and domain-specific vocabulary to manage the complexity of the topic and convey a style appropriate to the discipline and context as well as to the expertise of likely readers."}, {"retrieved": "2016-12-31 23:39:19.681658", "children": [], "standard_slug": "e", "text": "CCSS.ELA-Literacy.WHST.9-10.2.e Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing."}, {"retrieved": "2016-12-31 23:39:19.681658", "children": [], "standard_slug": "f", "text": "CCSS.ELA-Literacy.WHST.9-10.2.f Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic)."}], "standard_slug": "2", "text": "CCSS.ELA-Literacy.WHST.9-10.2 Write informative/explanatory texts, including the narration of historical events, scientific procedures/ experiments, or technical processes."}