{"children": [{"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "1", "text": "CCSS.ELA-Literacy.RL.7.1 Cite several pieces of textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "2", "text": "CCSS.ELA-Literacy.RL.7.2 Determine a theme or central idea of a text and analyze its development over the course of the text; provide an objective summary of the text."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "3", "text": "CCSS.ELA-Literacy.RL.7.3 Analyze how particular elements of a story or drama interact (e.g., how setting shapes the characters or plot)."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "4", "text": "CCSS.ELA-Literacy.RL.7.4 Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of rhymes and other repetitions of sounds (e.g., alliteration) on a specific verse or stanza of a poem or section of a story or drama."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "5", "text": "CCSS.ELA-Literacy.RL.7.5 Analyze how a drama's or poem's form or structure (e.g., soliloquy, sonnet) contributes to its meaning"}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "6", "text": "CCSS.ELA-Literacy.RL.7.6 Analyze how an author develops and contrasts the points of view of different characters or narrators in a text."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "7", "text": "CCSS.ELA-Literacy.RL.7.7 Compare and contrast a written story, drama, or poem to its audio, filmed, staged, or multimedia version, analyzing the effects of techniques unique to each medium (e.g., lighting, sound, color, or camera focus and angles in a film)."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "8", "text": "CCSS.ELA-Literacy.RL.7.8 (RL.7.8 not applicable to literature)"}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "9", "text": "CCSS.ELA-Literacy.RL.7.9 Compare and contrast a fictional portrayal of a time, place, or character and a historical account of the same period as a means of understanding how authors of fiction use or alter history."}, {"retrieved": "2016-12-31 23:39:02.569866", "children": [], "standard_slug": "10", "text": "CCSS.ELA-Literacy.RL.7.10 By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."}], "standard_slug": "7", "text": "Grade 7"}