{"children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.6.NS.A.1 Interpret and compute quotients of fractions, and solve word problems involving division of fractions by fractions, e.g., by using visual fraction models and equations to represent the problem. For example, create a story context for (2/3) ÷ (3/4) and use a visual fraction model to show the quotient; use the relationship between multiplication and division to explain that (2/3) ÷ (3/4) = 8/9 because 3/4 of 8/9 is 2/3. (In general, (a/b) ÷ (c/d) = ad/bc.) How much chocolate will each person get if 3 people share 1/2 lb of chocolate equally? How many 3/4-cup servings are in 2/3 of a cup of yogurt? How wide is a rectangular strip of land with length 3/4 mi and area 1/2 square mi? ."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.6.NS.B.2 Fluently divide multi-digit numbers using the standard algorithm."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.6.NS.B.3 Fluently add, subtract, multiply, and divide multi-digit decimals using the standard algorithm for each operation."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.6.NS.B.4 Find the greatest common factor of two whole numbers less than or equal to 100 and the least common multiple of two whole numbers less than or equal to 12. Use the distributive property to express a sum of two whole numbers 1-100 with a common factor as a multiple of a sum of two whole numbers with no common factor. For example, express 36 + 8 as 4 (9 + 2). ."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [{"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.6.NS.C.5 Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above/below zero, elevation above/below sea level, credits/debits, positive/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.6.NS.C.6 Understand a rational number as a point on the number line. Extend number line diagrams and coordinate axes familiar from previous grades to represent points on the line and in the plane with negative number coordinates."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.6.NS.C.7 Understand ordering and absolute value of rational numbers."}, {"retrieved": "2016-12-31 23:38:50.479575", "children": [], "standard_slug": "8", "text": "CCSS.Math.Content.6.NS.C.8 Solve real-world and mathematical problems by graphing points in all four quadrants of the coordinate plane. Include use of coordinates and absolute value to find distances between points with the same first coordinate or the same second coordinate."}], "standard_slug": "C", "text": "C"}], "standard_slug": "NS", "text": "The Number System"}