{"text": "Grade 4", "children": [{"text": "CCSS.ELA-Literacy.RI.4.1 Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text.", "children": [], "standard_slug": "1", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.2 Determine the main idea of a text and explain how it is supported by key details; summarize the text.", "children": [], "standard_slug": "2", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.3 Explain events, procedures, ideas, or concepts in a historical, scientific, or technical text, including what happened and why, based on specific information in the text.", "children": [], "standard_slug": "3", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.4 Determine the meaning of general academic and domain-specific words or phrases in a text relevant to a grade 4 topic or subject area .", "children": [], "standard_slug": "4", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.5 Describe the overall structure (e.g., chronology, comparison, cause/effect, problem/solution) of events, ideas, concepts, or information in a text or part of a text.", "children": [], "standard_slug": "5", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.6 Compare and contrast a firsthand and secondhand account of the same event or topic; describe the differences in focus and the information provided.", "children": [], "standard_slug": "6", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.7 Interpret information presented visually, orally, or quantitatively (e.g., in charts, graphs, diagrams, time lines, animations, or interactive elements on Web pages) and explain how the information contributes to an understanding of the text in which it appears.", "children": [], "standard_slug": "7", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.8 Explain how an author uses reasons and evidence to support particular points in a text.", "children": [], "standard_slug": "8", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.9 Integrate information from two texts on the same topic in order to write or speak about the subject knowledgeably.", "children": [], "standard_slug": "9", "retrieved": "2016-12-31 23:39:08.287443"}, {"text": "CCSS.ELA-Literacy.RI.4.10 By the end of year, read and comprehend informational texts, including history/social studies, science, and technical texts, in the grades 4-5 text complexity band proficiently, with scaffolding as needed at the high end of the range.", "children": [], "standard_slug": "10", "retrieved": "2016-12-31 23:39:08.287443"}], "standard_slug": "4"}