{"children": [{"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "1", "text": "CCSS.ELA-Literacy.RL.4.1 Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "2", "text": "CCSS.ELA-Literacy.RL.4.2 Determine a theme of a story, drama, or poem from details in the text; summarize the text."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "3", "text": "CCSS.ELA-Literacy.RL.4.3 Describe in depth a character, setting, or event in a story or drama, drawing on specific details in the text (e.g., a character's thoughts, words, or actions)."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "4", "text": "CCSS.ELA-Literacy.RL.4.4 Determine the meaning of words and phrases as they are used in a text, including those that allude to significant characters found in mythology (e.g., Herculean)."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "5", "text": "CCSS.ELA-Literacy.RL.4.5 Explain major differences between poems, drama, and prose, and refer to the structural elements of poems (e.g., verse, rhythm, meter) and drama (e.g., casts of characters, settings, descriptions, dialogue, stage directions) when writing or speaking about a text."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "6", "text": "CCSS.ELA-Literacy.RL.4.6 Compare and contrast the point of view from which different stories are narrated, including the difference between first- and third-person narrations."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "7", "text": "CCSS.ELA-Literacy.RL.4.7 Make connections between the text of a story or drama and a visual or oral presentation of the text, identifying where each version reflects specific descriptions and directions in the text."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "8", "text": "CCSS.ELA-Literacy.RL.4.8 (RL.4.8 not applicable to literature)"}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "9", "text": "CCSS.ELA-Literacy.RL.4.9 Compare and contrast the treatment of similar themes and topics (e.g., opposition of good and evil) and patterns of events (e.g., the quest) in stories, myths, and traditional literature from different cultures."}, {"retrieved": "2016-12-31 23:39:01.089535", "children": [], "standard_slug": "10", "text": "CCSS.ELA-Literacy.RL.4.10 By the end of the year, read and comprehend literature, including stories, dramas, and poetry, in the grades 4-5 text complexity band proficiently, with scaffolding as needed at the high end of the range."}], "standard_slug": "4", "text": "Grade 4"}