{"children": [{"retrieved": "2016-12-31 23:39:00.138391", "children": [{"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.HSS.MD.A.1 (+) Define a random variable for a quantity of interest by assigning a numerical value to each event in a sample space; graph the corresponding probability distribution using the same graphical displays as for data distributions."}, {"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.HSS.MD.A.2 (+) Calculate the expected value of a random variable; interpret it as the mean of the probability distribution."}, {"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.HSS.MD.A.3 (+) Develop a probability distribution for a random variable defined for a sample space in which theoretical probabilities can be calculated; find the expected value. For example, find the theoretical probability distribution for the number of correct answers obtained by guessing on all five questions of a multiple-choice test where each question has four choices, and find the expected grade under various grading schemes."}, {"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.HSS.MD.A.4 (+) Develop a probability distribution for a random variable defined for a sample space in which probabilities are assigned empirically; find the expected value. For example, find a current data distribution on the number of TV sets per household in the United States, and calculate the expected number of sets per household. How many TV sets would you expect to find in 100 randomly selected households?"}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:39:00.138391", "children": [{"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.HSS.MD.B.5 (+) Weigh the possible outcomes of a decision by assigning probabilities to payoff values and finding expected values."}, {"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.HSS.MD.B.6 (+) Use probabilities to make fair decisions (e.g., drawing by lots, using a random number generator)."}, {"retrieved": "2016-12-31 23:39:00.138391", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.HSS.MD.B.7 (+) Analyze decisions and strategies using probability concepts (e.g., product testing, medical testing, pulling a hockey goalie at the end of a game)."}], "standard_slug": "B", "text": "B"}], "standard_slug": "MD", "text": "Using Probability to Make Decisions"}