{"children": [{"children": [{"retrieved": "2016-12-31 23:38:48.952691", "children": [{"retrieved": "2016-12-31 23:38:48.952691", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.5.OA.A.1 Use parentheses, brackets, or braces in numerical expressions, and evaluate expressions with these symbols."}, {"retrieved": "2016-12-31 23:38:48.952691", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.5.OA.A.2 Write simple expressions that record calculations with numbers, and interpret numerical expressions without evaluating them. For example, express the calculation \"add 8 and 7, then multiply by 2\" as 2 × (8 + 7). Recognize that 3 × (18932 + 921) is three times as large as 18932 + 921, without having to calculate the indicated sum or product ."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:48.952691", "children": [{"retrieved": "2016-12-31 23:38:48.952691", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.5.OA.B.3 Generate two numerical patterns using two given rules. Identify apparent relationships between corresponding terms. Form ordered pairs consisting of corresponding terms from the two patterns, and graph the ordered pairs on a coordinate plane. For example, given the rule \"Add 3\" and the starting number 0, and given the rule \"Add 6\" and the starting number 0, generate terms in the resulting sequences, and observe that the terms in one sequence are twice the corresponding terms in the other sequence. Explain informally why this is so ."}], "standard_slug": "B", "text": "B"}], "standard_slug": "OA", "text": "Operations & Algebraic Thinking"}, {"children": [{"retrieved": "2016-12-31 23:38:49.113351", "children": [{"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.5.NBT.A.1 Recognize that in a multi-digit number, a digit in one place represents 10 times as much as it represents in the place to its right and 1/10 of what it represents in the place to its left."}, {"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.5.NBT.A.2 Explain patterns in the number of zeros of the product when multiplying a number by powers of 10, and explain patterns in the placement of the decimal point when a decimal is multiplied or divided by a power of 10. Use whole-number exponents to denote powers of 10."}, {"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.5.NBT.A.3 Read, write, and compare decimals to thousandths."}, {"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.5.NBT.A.4 Use place value understanding to round decimals to any place."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:49.113351", "children": [{"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.5.NBT.B.5 Fluently multiply multi-digit whole numbers using the standard algorithm."}, {"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "6", "text": "CCSS.Math.Content.5.NBT.B.6 Find whole-number quotients of whole numbers with up to four-digit dividends and two-digit divisors, using strategies based on place value, the properties of operations, and/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."}, {"retrieved": "2016-12-31 23:38:49.113351", "children": [], "standard_slug": "7", "text": "CCSS.Math.Content.5.NBT.B.7 Add, subtract, multiply, and divide decimals to hundredths, using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used."}], "standard_slug": "B", "text": "B"}], "standard_slug": "NBT", "text": "Number & Operations in Base Ten"}, {"children": [], "standard_slug": "NFA", "text": "Numbers & Operations—Fractions"}, {"children": [{"retrieved": "2016-12-31 23:38:49.505373", "children": [{"retrieved": "2016-12-31 23:38:49.505373", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.5.MD.A.1 Convert among different-sized standard measurement units within a given measurement system (e.g., convert 5 cm to 0.05 m), and use these conversions in solving multi-step, real world problems."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:49.505373", "children": [{"retrieved": "2016-12-31 23:38:49.505373", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.5.MD.B.2 Make a line plot to display a data set of measurements in fractions of a unit (1/2, 1/4, 1/8). Use operations on fractions for this grade to solve problems involving information presented in line plots. For example, given different measurements of liquid in identical beakers, find the amount of liquid each beaker would contain if the total amount in all the beakers were redistributed equally ."}], "standard_slug": "B", "text": "B"}, {"retrieved": "2016-12-31 23:38:49.505373", "children": [{"retrieved": "2016-12-31 23:38:49.505373", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.5.MD.C.3 Recognize volume as an attribute of solid figures and understand concepts of volume measurement."}, {"retrieved": "2016-12-31 23:38:49.505373", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.5.MD.C.4 Measure volumes by counting unit cubes, using cubic cm, cubic in, cubic ft, and improvised units."}, {"retrieved": "2016-12-31 23:38:49.505373", "children": [], "standard_slug": "5", "text": "CCSS.Math.Content.5.MD.C.5 Relate volume to the operations of multiplication and addition and solve real world and mathematical problems involving volume."}], "standard_slug": "C", "text": "C"}], "standard_slug": "MD", "text": "Measurement & Data"}, {"children": [{"retrieved": "2016-12-31 23:38:49.666573", "children": [{"retrieved": "2016-12-31 23:38:49.666573", "children": [], "standard_slug": "1", "text": "CCSS.Math.Content.5.G.A.1 Use a pair of perpendicular number lines, called axes, to define a coordinate system, with the intersection of the lines (the origin) arranged to coincide with the 0 on each line and a given point in the plane located by using an ordered pair of numbers, called its coordinates. Understand that the first number indicates how far to travel from the origin in the direction of one axis, and the second number indicates how far to travel in the direction of the second axis, with the convention that the names of the two axes and the coordinates correspond (e.g., x -axis and x -coordinate, y -axis and y -coordinate)."}, {"retrieved": "2016-12-31 23:38:49.666573", "children": [], "standard_slug": "2", "text": "CCSS.Math.Content.5.G.A.2 Represent real world and mathematical problems by graphing points in the first quadrant of the coordinate plane, and interpret coordinate values of points in the context of the situation."}], "standard_slug": "A", "text": "A"}, {"retrieved": "2016-12-31 23:38:49.666573", "children": [{"retrieved": "2016-12-31 23:38:49.666573", "children": [], "standard_slug": "3", "text": "CCSS.Math.Content.5.G.B.3 Understand that attributes belonging to a category of two-dimensional figures also belong to all subcategories of that category. For example, all rectangles have four right angles and squares are rectangles, so all squares have four right angles."}, {"retrieved": "2016-12-31 23:38:49.666573", "children": [], "standard_slug": "4", "text": "CCSS.Math.Content.5.G.B.4 Classify two-dimensional figures in a hierarchy based on properties."}], "standard_slug": "B", "text": "B"}], "standard_slug": "G", "text": "Geometry"}], "standard_slug": "5", "text": "Grade 5"}