{"children": [{"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "1", "text": "CCSS.ELA-Literacy.RI.7.1 Cite several pieces of textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "2", "text": "CCSS.ELA-Literacy.RI.7.2 Determine two or more central ideas in a text and analyze their development over the course of the text; provide an objective summary of the text."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "3", "text": "CCSS.ELA-Literacy.RI.7.3 Analyze the interactions between individuals, events, and ideas in a text (e.g., how ideas influence individuals or events, or how individuals influence ideas or events)."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "4", "text": "CCSS.ELA-Literacy.RI.7.4 Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of a specific word choice on meaning and tone."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "5", "text": "CCSS.ELA-Literacy.RI.7.5 Analyze the structure an author uses to organize a text, including how the major sections contribute to the whole and to the development of the ideas."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "6", "text": "CCSS.ELA-Literacy.RI.7.6 Determine an author's point of view or purpose in a text and analyze how the author distinguishes his or her position from that of others."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "7", "text": "CCSS.ELA-Literacy.RI.7.7 Compare and contrast a text to an audio, video, or multimedia version of the text, analyzing each medium's portrayal of the subject (e.g., how the delivery of a speech affects the impact of the words)."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "8", "text": "CCSS.ELA-Literacy.RI.7.8 Trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "9", "text": "CCSS.ELA-Literacy.RI.7.9 Analyze how two or more authors writing about the same topic shape their presentations of key information by emphasizing different evidence or advancing different interpretations of facts."}, {"retrieved": "2016-12-31 23:39:09.415388", "children": [], "standard_slug": "10", "text": "CCSS.ELA-Literacy.RI.7.10 By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."}], "standard_slug": "7", "text": "Grade 7"}